Show / Hide Table of Contents
Class LoadBase
Load base object
Inheritance
System.Object
OpenObject
LoadBase
LineLoad
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class LoadBase : OpenObject
Properties
Improve this Doc   View Source
Id
Element Id
Declaration
[DataMember]
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source